# StairsRunBottomElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunBottomElevation Property
ParameterTypeId Class See Also
---
"Relative Base Height": Relative height to stairs bottom elevation
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunBottomElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunBottomElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunBottomElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace